# ----------------------------
# manage_weather.py configs
# ----------------------------
API_KEY = "SLnUCvSqwv%2FeT7pxQ2NFc2etMr8%2B7HLq1zXs6Djr1%2BXDUA%2F4YQvKK7C3nhGjIjOX0Vs42IoiIg%2FEQgHpcP371w%3D%3D"
NX = 60
NY = 127
TIME_LIST = ["0200", "0500", "0800", "1100", "1400", "1700", "2000", "2300"]


AUDIO_PATH = "audios/button.mp3"
BG_IMG_PATH = "images/background.jpg"
# -----------------------------
# 기본 작물 데이터베이스
# -----------------------------

crop_db = {
    "상추": {"파종": "03-01", "수확": "05-15", "급수주기": 2},
    "토마토": {"파종": "04-01", "수확": "07-01", "급수주기": 3},
    "고구마": {"파종": "05-01", "수확": "09-20", "급수주기": 5},
    "감자": {"파종": "6월 말", "수확": "05-15", "급수주기": 2},
    "완두": {"파종": "03-01", "수확": "05-15", "급수주기": 2},
    "강낭콩": {"파종": "03-01", "수확": "05-15", "급수주기": 2},
    "고추": {"파종": "03-01", "수확": "05-15", "급수주기": 2},
    "피망": {"파종": "03-01", "수확": "05-15", "급수주기": 2},
    "땅콩": {"파종": "03-01", "수확": "05-15", "급수주기": 2},
    "마늘": {"파종": "03-01", "수확": "05-15", "급수주기": 2},
    "무": {"파종": "03-01", "수확": "05-15", "급수주기": 2},
    "배추": {"파종": "03-01", "수확": "05-15", "급수주기": 2},
    "부추": {"파종": "03-01", "수확": "05-15", "급수주기": 2},
    "파": {"파종": "03-01", "수확": "05-15", "급수주기": 2},
    "사과": {"파종": "03-01", "수확": "05-15", "급수주기": 2},
    "배": {"파종": "03-01", "수확": "05-15", "급수주기": 2},
}  # 모든 작물의 정보가 들어가 있는 데이터베이스


def add_db(crop, sowing, harvest, water_cycle):
    if crop in crop_db:
        print(f"{crop}: 이미 등록된 작물입니다.")
    crop_db[crop] = {"파종": sowing, "수확": harvest, "급수주기": water_cycle}
