import pickle

crop_db = {
    "상추": {"파종": "03-01", "수확": "05-15", "급수주기": 2},
    "토마토": {"파종": "04-01", "수확": "07-01", "급수주기": 3},
    "고구마": {"파종": "05-01", "수확": "09-20", "급수주기": 5},
    "감자": {"파종": "6월 말", "수확": "05-15", "급수주기": 2},
    "완두": {"파종": "03-01", "수확": "05-15", "급수주기": 2},
    "강낭콩": {"파종": "03-01", "수확": "05-15", "급수주기": 2},
    "고추": {"파종": "03-01", "수확": "05-15", "급수주기": 2},
    "피망": {"파종": "03-01", "수확": "05-15", "급수주기": 2},
    "땅콩": {"파종": "03-01", "수확": "05-15", "급수주기": 2},
    "마늘": {"파종": "03-01", "수확": "05-15", "급수주기": 2},
    "무": {"파종": "03-01", "수확": "05-15", "급수주기": 2},
    "배추": {"파종": "03-01", "수확": "05-15", "급수주기": 2},
    "부추": {"파종": "03-01", "수확": "05-15", "급수주기": 2},
    "파": {"파종": "03-01", "수확": "05-15", "급수주기": 2},
    "사과": {"파종": "03-01", "수확": "05-15", "급수주기": 2},
    "배": {"파종": "03-01", "수확": "05-15", "급수주기": 2},
}  # 모든 작물의 정보가 들어가 있는 데이터베이스


with open("datas\\db.pkl", "wb") as f:
    pickle.dump(crop_db, f)
    f.truncate()

with open("datas\\crops.pkl", "wb") as f:
    pickle.dump({}, f)
    f.truncate()
